Tekla Open API Reference for Tekla Structures 2025
AnalysisPosition.Type Property
 The type of the position.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPosition.TypeEnum Type { get; set; }
Public Property Type As AnalysisPosition.TypeEnum
	Get
	Set
Property Value
Type: AnalysisPosition.TypeEnum
See Also
Reference
AnalysisPosition Class
Tekla.Structures.Analysis Namespace